{"wrapper":"div.collection-wrapper.wrapper","sections":{"be972458-70e0-4c2c-8aec-695205b98b0a":{"type":"image--image-with-text-overlay","settings":{"image":"shopify:\/\/shop_images\/Shooting_Page.jpg","image_height":"40vw","bg_image_overlay_opacity":25,"parallax":true,"title":"{{ collection.title }}","text":"","colors":"light","textPosition":"center","textAlignment":"center","heading--text-size":26,"text--text-size":18,"link":"","button_label":"","button-text":"#ffffff","button-background":"#262428","hover-button-text":"#ffffff","hover-button-background":"#494949"}},"collection-header":{"type":"template--collection--header","blocks":{"collection-image":{"type":"collection_image","settings":{"collection-image-size":"20vh"}},"title":{"type":"title","settings":{}}},"block_order":["collection-image","title"],"disabled":true,"settings":{}},"product-grid":{"type":"template--collection","blocks":{"product_card_image":{"type":"product_card_image","settings":{"enable_badges":true}},"product_card_title":{"type":"product_card_title","settings":{}},"product_card_price":{"type":"product_card_price","settings":{}}},"block_order":["product_card_image","product_card_title","product_card_price"],"settings":{"products-per-page":10,"desktop-products-per-row":3,"mobile-products-per-row":"2","pagination_options":"pagination_default","desktop_position":"topbar","enable_collection_title":false,"enable_collection_description":true,"enable_filtering":true,"enable_sorting":true}},"accordion_CYXhm7":{"type":"accordion","blocks":{"tab_content_V8hCnk":{"type":"tab_content","settings":{"question":"Is Shooting Eyewear Necessary?","text":"<p>Wearing glasses while shooting is crucial for both safety and performance. <\/p><p>The primary reason is eye protection - shooting eyewear shields your eyes from potential injuries caused by ejected cartridge cases, ricocheting fragments, or debris. They also safeguard against muzzle gases and unburned powder particles. <\/p><p>Beyond safety, shooting glasses  enhance visual acuity and target acquisition through specialized tints and coatings, thereby improving your accuracy. Plus, they protect your eyes from harmful UV rays during outdoor shooting sessions and reduce eye strain, allowing for a more comfortable experience.<\/p>"}},"tab_content_JPQyKb":{"type":"tab_content","settings":{"question":"What Is the Best Lens Color For Shooting Glasses?","text":"<p>The best lens color for shooting glasses often depend on the lighting conditions and shooting environment. However, clear lenses, gray, vermilion (reddish-orange) and amber tints are top choices. <\/p><p>Vermilion enhances the orange color of clay targets against various backgrounds, making it excellent for skeet and trap shooting. Amber or yellow lenses increase contrast and depth perception, which is beneficial in both bright and low-light conditions. <\/p><p>For bright, sunny days, gray or brown lenses can reduce overall glare without distorting colors. <\/p><p>Some shooters prefer clear lenses for indoor ranges or low-light situations, prioritizing maximum light transmission and true color perception.<\/p>"}},"tab_content_rpnLhg":{"type":"tab_content","settings":{"question":"What Makes Glasses Shooting Glasses?","text":"<p>The primary feature is impact resistance, with lenses from polycarbonate or other materials that meet or exceed ANSI Z87.1 safety standards to protect the eyes from ricochets and debris. <\/p><p>Also, shooting sunglasses have wrap-around designs or side shields to provide peripheral protection. Many shooting glasses have interchangeable lenses with various tints to enhance target visibility in different lighting conditions. <\/p><p>Additionally, they're designed for a secure, comfortable fit to prevent slipping during recoil and to allow for extended wear during long shooting ses<\/p>"}},"tab_content_eKUKRW":{"type":"tab_content","settings":{"question":"Should Shooting Glasses Be Tinted?","text":"<p>While tinted lenses can be highly beneficial for shooting glasses, their necessity depends on the shooting conditions and personal preference. <\/p><p>Tints can enhance contrast, reduce glare, and improve target visibility in various lighting situations. However, in low-light conditions or indoor ranges, clear or light-tinted lenses may be more appropriate to maximize light transmission. <\/p><p>Many shooters prefer glasses with interchangeable lenses, allowing them to adapt to different environments and lighting conditions for optimal performance and eye comfort.<\/p>"}}},"block_order":["tab_content_V8hCnk","tab_content_JPQyKb","tab_content_rpnLhg","tab_content_eKUKRW"],"settings":{"colors":"white","title":"Frequently Asked Questions","faq_icon":"caret"}}},"order":["be972458-70e0-4c2c-8aec-695205b98b0a","collection-header","product-grid","accordion_CYXhm7"]}