{"wrapper":"div.collection-wrapper.wrapper","sections":{"08cb79e0-f230-4261-8497-e45c6698ce02":{"type":"image--image-with-text-overlay","settings":{"image":"shopify:\/\/shop_images\/womens_option_2.jpg","image_height":"40vw","bg_image_overlay_opacity":45,"parallax":true,"title":"Women's Sunglasses","text":"Embrace style and comfort with our women's collection of premium sunglasses","colors":"light","textPosition":"right","textAlignment":"right","heading--text-size":26,"text--text-size":18,"link":"","button_label":"","button-text":"#ffffff","button-background":"#262428","hover-button-text":"#ffffff","hover-button-background":"#494949"}},"dff60c6f-7fbe-4600-b53d-1a5a19d1f9cf":{"type":"text--rich-text","settings":{"colors":"white","title":"Empower Your Adventures","text":"<p>Every woman is unique, and so are her adventures. With this in mind, we've crafted our women's sunglasses collection to deliver the ultimate in style, comfort, and vision. Whether you're hiking sunlit trails, conquering mountain peaks, or enjoying a beach getaway, our female sunglasses ensure that you experience your journey with unparalleled clarity and style.<\/p>","button_label":"","button_link":""}},"collection-header":{"type":"template--collection--header","blocks":{"collection-image":{"type":"collection_image","disabled":true,"settings":{"collection-image-size":"30vh"}},"title":{"type":"title","settings":{}}},"block_order":["collection-image","title"],"disabled":true,"settings":{}},"product-grid":{"type":"template--collection","blocks":{"product_card_image":{"type":"product_card_image","settings":{"enable_badges":true}},"product_card_title":{"type":"product_card_title","settings":{}},"product_card_price":{"type":"product_card_price","settings":{}}},"block_order":["product_card_image","product_card_title","product_card_price"],"settings":{"products-per-page":8,"desktop-products-per-row":3,"mobile-products-per-row":"2","pagination_options":"pagination_default","desktop_position":"topbar","enable_collection_title":false,"enable_collection_description":true,"enable_filtering":true,"enable_sorting":true}},"2dafb495-a1ac-4f24-80ee-aa7411a2ca2f":{"type":"image--image-with-text","settings":{"colors":"light","image":"shopify:\/\/shop_images\/Skeleton_Optics_Sunglasses-097.jpg","text_overlapping_image":false,"section-width":"full","layout":"left","text_alignment":"center","title":"Embrace the Elements – Womens  Sunglasses Built to Last","text":"<p>Discover your perfect pair in our diverse collection. Our range offers an array of styles and lens options designed to cater to your unique tastes and needs. From vibrant lens hues that pop to classic, sophisticated styles, there’s a pair of Skeleton Optics sunglasses that’s just right for you.<\/p><p>We believe that quality, style, and functionality should never be compromised, especially when it comes to exploring the great outdoors. <\/p><p>Our women's sunglasses are meticulously handcrafted with premium materials, featuring frames designed for a perfect fit and lenses engineered with state-of-the-art Zeiss technology. <\/p><p>Enjoy superior durability, comfort, and polarized vision that doesn't compromise on style.<\/p>","button_label":"","button_link":""}},"accordion_YMLJYJ":{"type":"accordion","blocks":{"tab_content_zAH3P4":{"type":"tab_content","settings":{"question":"What Shape of Sunglasses Is Best For Women?","text":"<p>The best shape for women's sunglasses depends largely on face shape and personal style. <\/p><p>While oval faces can wear most styles, round faces benefit from angular frames like wayfarers or cat-eye sunglasses. Square faces are complemented by round or oval frames, and heart-shaped faces look great in aviators or bottom-heavy frames. <\/p><p>Ultimately, the most flattering women's sunglasses are those that align with your face shape.<\/p>"}},"tab_content_cqRDcH":{"type":"tab_content","settings":{"question":"How Many Pairs of Sunglasses Should a Woman Own?","text":"<p>While there's no strict rule, a well-curated collection of women's eyewear typically includes 3-5 pairs to cover various occasions and outfits. <\/p><p>1. A pair for everyday wear.<\/p><p>2. A sporty pair for outdoor activities.<\/p><p>3. A glamorous style for special events, and perhaps a trendy pair to express your fashion-forward side. <\/p><p>You can always expand your collection further based on their lifestyle or fashion interests, but these core styles provide a solid foundation for most situations and ensembles.<\/p>"}},"tab_content_wHjGjW":{"type":"tab_content","settings":{"question":"Are Polarized Lenses Worth it For Women's Sunglasses?","text":"<p>Polarized lenses offer both style and functionality. <\/p><p>They significantly reduce glare from reflective surfaces like water, snow, or car windshields, enhancing visual comfort and clarity. This makes them excellent for outdoor activities and driving.<\/p><p>While they may be slightly more expensive, many women find the improved visual experience and reduced eye strain well worth the investment, especially in high-quality sunglasses designed for both fashion and performance.<\/p>"}},"tab_content_ieHYgw":{"type":"tab_content","settings":{"question":"How Do I Choose Sunglasses That Complement My Skin Tone?","text":"<p>Cool skin tones often look best with frames in black, silver, blue, or pink hues. Warm skin tones are complemented by frames in gold, brown, olive, or honey shades. <\/p><p>For neutral skin tones, most colors work well, giving you the freedom to choose based on personal preference. Remember, the right pair of sunglasses should enhance your natural beauty and make you feel even more confident.<\/p>"}}},"block_order":["tab_content_zAH3P4","tab_content_cqRDcH","tab_content_wHjGjW","tab_content_ieHYgw"],"settings":{"colors":"white","title":"Frequently Asked Questions","faq_icon":"caret"}}},"order":["08cb79e0-f230-4261-8497-e45c6698ce02","dff60c6f-7fbe-4600-b53d-1a5a19d1f9cf","collection-header","product-grid","2dafb495-a1ac-4f24-80ee-aa7411a2ca2f","accordion_YMLJYJ"]}