{"wrapper":"div.collection-wrapper.wrapper","sections":{"08cb79e0-f230-4261-8497-e45c6698ce02":{"type":"image--image-with-text-overlay","settings":{"image":"shopify:\/\/shop_images\/Skeleton_Optics_Sunglasses-005.jpg","image_height":"40vw","bg_image_overlay_opacity":45,"parallax":true,"title":"Capture the Thrill with Hunting Sunglasses","text":"Elevate your hunt with the clarity of glasses made with Zeiss lenses","colors":"light","textPosition":"left","textAlignment":"right","heading--text-size":26,"text--text-size":18,"link":"","button_label":"","button-text":"#ffffff","button-background":"#262428","hover-button-text":"#ffffff","hover-button-background":"#494949"}},"dff60c6f-7fbe-4600-b53d-1a5a19d1f9cf":{"type":"text--rich-text","settings":{"colors":"white","title":"Weather the Wilderness - Robust Hunting Eyewear for the Avid Hunter","text":"<p>Step up your hunting game with Skeleton Optics. Our hunting glasses helps you spot game easily while reducing eye strain during long hunts. Built to withstand rugged outdoor conditions, these durable frames provide all-day comfort and UV protection. Join a community of savvy hunters who choose clarity and style.<\/p>","button_label":"","button_link":""}},"collection-header":{"type":"template--collection--header","blocks":{"collection-image":{"type":"collection_image","settings":{"collection-image-size":"30vh"}},"title":{"type":"title","settings":{}}},"block_order":["collection-image","title"],"disabled":true,"settings":{}},"product-grid":{"type":"template--collection","blocks":{"product_card_image":{"type":"product_card_image","settings":{"enable_badges":true}},"product_card_title":{"type":"product_card_title","settings":{}},"product_card_price":{"type":"product_card_price","settings":{}}},"block_order":["product_card_image","product_card_title","product_card_price"],"settings":{"products-per-page":8,"desktop-products-per-row":3,"mobile-products-per-row":"2","pagination_options":"pagination_default","desktop_position":"topbar","enable_collection_title":false,"enable_collection_description":true,"enable_filtering":true,"enable_sorting":true}},"2dafb495-a1ac-4f24-80ee-aa7411a2ca2f":{"type":"image--image-with-text","settings":{"colors":"light","image":"shopify:\/\/shop_images\/Skeleton_Optics_Sunglasses-092.jpg","text_overlapping_image":false,"section-width":"full","layout":"left","text_alignment":"center","title":"Transform Your Hunt - Premium Hunting Sunglasses","text":"<p>Skeleton Optics is revolutionizing the hunting experience with our high-end Hunting Sunglasses. Our purpose-built eyewear is designed to augment your outdoor adventures, taking your hunting prowess to new heights.<br\/><br\/>Designed for the discerning hunter, each pair features our world-renowned, polarized Carl Zeiss Vision lenses. These state-of-the-art lenses drastically reduce glare, providing unparalleled clarity and precision. With our sunglasses, spotting your target even in complex light conditions becomes significantly easier. The crispness of vision we provide sets you apart in the wilderness, enhancing your performance by ensuring you never miss a detail.<br\/><br\/>Our sunglasses are not just functional; they also speak volumes about your style. With an extensive range of designs, Skeleton Optics has a pair for every hunter and every hunting scenario. From sleek models that fit comfortably under a cap to sturdy designs that withstand the rigors of a high-action hunt, we've got you covered.<br\/><br\/>Transform your hunting adventures from mere outdoor trips to memorable experiences with Skeleton Optics. Explore our collection and find the perfect pair to take your hunting game to the next level.<\/p>","button_label":"","button_link":""}},"accordion_76AQTf":{"type":"accordion","blocks":{"tab_content_bzwqL8":{"type":"tab_content","settings":{"question":"What Is the Best Color For Hunting Glasses?","text":"<p>The most effective lens color depends on the environment and lighting conditions, but amber or brown tints are considered top choices. <\/p><p>These colors enhance contrast and depth perception, making it easier to spot game against various backgrounds. <\/p><p>However, for low-light conditions or densely wooded areas, yellow or light amber lenses can brighten the field of view. <\/p><p>In very bright, open environments, gray or green lenses may be preferable as they reduce overall brightness without distorting colors. <\/p><p>Some hunters also opt for interchangeable lens systems to adapt to different hunting scenarios and times of day.<\/p>"}},"tab_content_GNFGxM":{"type":"tab_content","settings":{"question":"Should I Wear Sunglasses When Hunting?","text":"<p>Wearing sunglasses while hunting is best for both safety and performance. Quality hunting eyewear protect your eyes from harmful UV rays, flying debris, and potential injuries. <\/p><p>They also reduce glare and eye strain, which is crucial for spotting game and maintaining visual acuity during long periods in the field. <\/p><p>Yet, it's important to choose sunglasses specifically designed for hunting, with appropriate lens tints that enhance contrast without overly darkening your field of view. <\/p><p>In low-light conditions, such as dawn or dusk, you may want to switch to clear protective lenses or yellow-tinted glasses that brighten the surroundings.<\/p>"}},"tab_content_AKBAwJ":{"type":"tab_content","settings":{"question":"Will Hunting Eyewear Scare Animals Away?","text":"<p>No. As long as the glasses have no mirrored reflection. <\/p><p>Most quality hunting glasses are designed with matte finishes and non-reflective coatings to minimize glare that could alert wildlife to your presence.<\/p><p>The right eyewear will improve your stealth by reducing the visibility of your eyes and helping you spot game before they notice you. <\/p><p>So as long as you choose appropriate eyewear, you're safe.<\/p>"}}},"block_order":["tab_content_bzwqL8","tab_content_GNFGxM","tab_content_AKBAwJ"],"settings":{"colors":"white","title":"FAQs","faq_icon":"caret"}}},"order":["08cb79e0-f230-4261-8497-e45c6698ce02","dff60c6f-7fbe-4600-b53d-1a5a19d1f9cf","collection-header","product-grid","2dafb495-a1ac-4f24-80ee-aa7411a2ca2f","accordion_76AQTf"]}