{"wrapper":"div.collection-wrapper.wrapper","sections":{"08cb79e0-f230-4261-8497-e45c6698ce02":{"type":"image--image-with-text-overlay","custom_css":["h1 {font-size: 32px;}"],"settings":{"image":"shopify:\/\/shop_images\/Skeleton_Optics_Sunglasses-062.jpg","image_height":"40vw","bg_image_overlay_opacity":45,"parallax":true,"title":"Conquer the Waters with Skeleton Optics Fishing Sunglasses","text":"Experience unparalleled vision and style with fishing sunglasses made with ZEISS lenses.","colors":"light","textPosition":"right","textAlignment":"right","heading--text-size":26,"text--text-size":18,"link":"","button_label":"","button-text":"#ffffff","button-background":"#262428","hover-button-text":"#ffffff","hover-button-background":"#494949"}},"dff60c6f-7fbe-4600-b53d-1a5a19d1f9cf":{"type":"text--rich-text","custom_css":[],"settings":{"colors":"white","title":"Transform Your Angling Adventure With Our Polarized Fishing Sunglasses","text":"<p>Take your angling experience to new heights with Skeleton Optics. Armed with our polarized fishing sunglasses, you'll not only reduce glare but spot your catch with unprecedented clarity. It's a new era of fishing, and you're leading the way.<\/p>","button_label":"","button_link":""}},"collection-header":{"type":"template--collection--header","blocks":{"title":{"type":"title","disabled":true,"settings":{}}},"block_order":["title"],"disabled":true,"settings":{}},"product-grid":{"type":"template--collection","blocks":{"product_card_image":{"type":"product_card_image","settings":{"enable_badges":true}},"product_card_title":{"type":"product_card_title","settings":{}},"product_card_price":{"type":"product_card_price","settings":{}}},"block_order":["product_card_image","product_card_title","product_card_price"],"settings":{"products-per-page":10,"desktop-products-per-row":3,"mobile-products-per-row":"2","pagination_options":"pagination_default","desktop_position":"topbar","enable_collection_title":false,"enable_collection_description":true,"enable_filtering":true,"enable_sorting":true}},"2dafb495-a1ac-4f24-80ee-aa7411a2ca2f":{"type":"image--image-with-text","settings":{"colors":"light","image":"shopify:\/\/shop_images\/DI9A4472.jpg","text_overlapping_image":false,"section-width":"full","layout":"left","text_alignment":"center","title":"Embrace the Elements – Rugged Fishing Sunglasses Built to Last","text":"<p>Brace yourself for the elements with Skeleton Optics' Fishing Sunglasses, engineered with precision for those who dare to venture into the unknown. When it comes to fishing, we understand that conditions can change in a heartbeat. Sunny skies can turn cloudy, calm waters can become turbulent, and serene breezes can transform into strong gusts. But no matter how challenging or unpredictable the circumstances, your vision shouldn't have to suffer.<br\/><br\/>Crafted with robust, Italian-made frames and scratch-resistant Carl Zeiss Vision lenses, our fishing sunglasses are built to endure the unexpected. They offer a shield that stands up to intense sun, driving rain, saltwater sprays, and occasional drops or impacts. These resilient traits mean that you can rely on your sunglasses to stay in optimal condition even during the most demanding fishing trips.<br\/><br\/>Join the ranks of discerning fishermen who have already discovered the exceptional performance of Skeleton Optics' Fishing Sunglasses. Dive into your next fishing adventure with the ultimate confidence that comes from being prepared for whatever Mother Nature might throw at you.<\/p>","button_label":"","button_link":""}},"accordion_3BxdcF":{"type":"accordion","blocks":{"tab_content_dJaaqY":{"type":"tab_content","settings":{"question":"How Do Fishing Sunglasses Differ From Regular Sunglasses?","text":"<p>Fishing sunglasses are specifically designed to enhance vision on water, with polarized lenses that reduce glare from reflective surfaces and improve visibility beneath the water's surface. <\/p><p>At Skeleton Optics, we feature Carl Zeiss specialized lens tints to boost contrast and clarity in various light conditions, making it easier for you to spot fish and underwater structures. <\/p><p>Additionally, our fishing sunglasses are built with durable materials to withstand exposure to salt water, sand, and extended sun exposure, ensuring they last longer in harsh marine environments.<\/p>"}},"tab_content_tVV8Jy":{"type":"tab_content","settings":{"question":"What Sunglass Lens Color Is Best For Fishing?","text":"<p>Polarized gray or amber lenses are often considered the best options. <\/p><p>Gray lenses provide true color perception and work well in bright, sunny conditions, making them ideal for offshore fishing. Amber or copper-tinted lenses enhance contrast and depth perception, which is crucial for spotting fish in shallow waters or on overcast days. <\/p><p>However, some anglers prefer green-tinted lenses, which offers a balance and provides good visibility in a variety of light conditions and water depths.<\/p>"}},"tab_content_gCEacr":{"type":"tab_content","settings":{"question":"Do You Really Need Polarized Sunglasses For Fishing?","text":"<p>While not absolutely mandatory, polarized sunglasses offer significant advantages for fishing. <\/p><p>They dramatically reduce glare from the water's surface and help you see beneath the water to spot fish easily. This improved visibility will enhance your fishing experience and success rate, especially when sight-fishing or casting to specific targets. <\/p><p>Additionally, polarized lenses provide better overall UV protection, making them a highly recommended investment for both casual and serious anglers.<\/p>"}},"tab_content_h3biAd":{"type":"tab_content","settings":{"question":"Are Plastic or Glass Lenses Better For Fishing?","text":"<p>Both plastic and glass lenses have their merits for fishing sunglasses, but plastic lenses are generally favored. <\/p><p>Plastic lenses, particularly those made from polycarbonate, are lightweight, impact-resistant, and less likely to shatter, making them safer for active anglers. <\/p><p>They're also less expensive and offer excellent optical clarity. <\/p><p>Glass lenses, while heavier, provide superior scratch resistance and the clearest optics possible. However, their weight and potential to shatter make them less ideal for most fishing scenarios, except for those who prioritize absolute top-tier visual clarity over other factors.<\/p><p>However, with Skeleton Optics, you get the best of both worlds as our lenses are made with Zeiss technology.<\/p>"}}},"block_order":["tab_content_dJaaqY","tab_content_tVV8Jy","tab_content_gCEacr","tab_content_h3biAd"],"settings":{"colors":"white","title":"Frequently Asked Questions","faq_icon":"caret"}}},"order":["08cb79e0-f230-4261-8497-e45c6698ce02","dff60c6f-7fbe-4600-b53d-1a5a19d1f9cf","collection-header","product-grid","2dafb495-a1ac-4f24-80ee-aa7411a2ca2f","accordion_3BxdcF"]}